OdGeMatrix2d.op_FunctionCall(System.Int32,System.Int32)
\details
Returns or references entry[row][column] as matrix(row,column).
\param row [in]  Row.
\param column [in]  Column.

OdGeMatrix2d.op_Subscript(System.Int32)
\details
Returns or references entry[row] as matrix[row].
\param row [in]  Row.

OdGeMatrix2d.isConformal(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if an only if this matrix is conformal (isUniScaledOrtho()),
and returns the scale factor, angle of rotation,
the presence of a mirror component to the matrix,
and the direction of reflection.
\param scale [out]  Receives the scale factor.
\param angle [out]  Receives the angle of rotation.
\param isMirror [out]  Receives true if andn only if the matrix has a mirror component.
\param reflex [in]  Direction of reflection.
\remarks
reflex is valid if and only if isMirror is true.

OdGeMatrix2d.op_Inequality(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator.

OdGeMatrix2d.op_Equality(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator.

OdGeMatrix2d.isSingular(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this matrix is singular.
\remarks
* A matrix is singular if and only if its determinant == 0.
* A singular matrix cannot be inverted.

OdGeMatrix2d.op_MultiplicationAssignment(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this matrix to the product (this matrix) * matrix, and returns
a reference to this matrix.

OdGeMatrix2d.op_Multiply(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the product (this matrix) * matrix.